{"keras_version": "1.0.7", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 16, 64, 3], "arguments": {}, "input_dtype": "float32", "name": "lambda_1", "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faO/Users/codemanneil/Workspace/SelfDrivingCar/CarND-BehavioralCloning-P3/model.py\u00da\b<lambda>\u0088\u0000\u0000\u0000s\u0000\u0000\u0000\u0000"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_1", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "nb_col": 3, "init": "he_normal", "subsample": [1, 1], "name": "convolution2d_6", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_1", "output_dim": 512, "W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"init": "he_normal", "name": "dense_2", "output_dim": 64, "W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "output", "output_dim": 1, "W_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "b_constraint": null}}]}